In [28]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
# pd.options.display.float_format = '{:,.2f}'.format

In [ ]:
import requests
import io
url = "https://raw.githubusercontent.com/jbrownlee/Datasets/master/airline-passengers.csv"
s = requests.get(url).content
data = pd.read_csv(io.StringIO(s.decode('utf-8')))

# Table of Contents
* [Add column level](#add-column-level)
* [stack](#stack)
* [cumulitive sum after groupby ](#cum-sum-after-groupby)
* [Style ](#style)
* [from-list-in-cell-to-new-columns ](#from-list-in-cell-to-new-columns)
* [melt (from many columns to one) ](#melt)

За счет чего можно ускорить работу pandas
- указываем формат, когда парсим дату, иначе пандас будет перебирать много разных форматов и смотерть какой подходит
`pd.to_datetime(df[column_name_with_datetime], format='%d/%m/%y %H:%M')`
- работаем с векторами, а не отдельными записями. Векторная операция в разы быстрее  
Каждый раз, когда нам нужно что-то сделать со столбцами, думаем а можно тут применить функцию numpy  
например округление значений столбца, лучше либо отадть столбец функции `np.ceil`, либо сделать `apply` и туда отдать `np.ceil`  
Таким способом мы будем проводить операцию со всем столбцом как с вектором, что значительно ускорит процесс.  
Поэтому свои функции для обработки занчений столбцов, в которых мы работаем с каждым значением пишем только в самом крайнем случае  
- используем `pandarallel`
- думаем о датафрейме как о наборе столбцов, тогда выбор методов для работы уже будут более быстрыми  
Если у нас датафрейм пользователей и есть имя, возраст, рост, то мы воспринимаем это как выборка имен, выборка ростов и выборка возрастов    
- не используем циклы для работы с датафреймами
Так как в памяти датафрейм хранится колонками и колонки не идут по порядку, они могут в памяти лежать где угодно рандомно  
И когда мы начинаем итерировать датафрейм, то пандас начинает сопоставлять индексы разных колонок и искать где что лежит по индексу для каждой колонки  
и это будет на каждой итерации. И для каждой колонки нужно найти ее индекс, потом собрать это в строчку и так далее.  
Поэтому вообще любые использования loc и iloc должны быть без циклов, так как каждая такая опреация занимает много времени на поиска элемента в памяти по индексу.  
- стараемся всегда использовать булевы маски, когда нужно фильтровать фрейм
- вместо loc и iloc используем, когда это возможно, pd.cut  
Вообще когда нам нужно провести операции над датафреймом, то стараемся делать это операциями с колонками,  
поэтому сначал формируем колонки, которых у нас нет, но они нужны для расчетов и потом умножаем колонки
например, у нас есть столбец с датой и столбец со стоимостью тарифа и мы хотим с 0 до 8 увеличить в 2 раза, с 8 до 16 в 3 раза, а с 16 до 0 увеличить в 4 раза  
Так медленно, потому что несколько рэнжей, потом нескоько Loc, при которых будет выбираться куски из общего дата фреймя
```
peak_hours = df.index.hour.isin(range(0, 9))
middle_hours = df.index.hour.isin(range(9, 17))
low_hours = df.index.hour.isin(range(17, 25))

df.loc[peak_hours, 'cost_cents'] = df.loc[peak_hours, 'energy_kw'] * 2
df.loc[middle_hours, 'cost_cents'] = df.loc[middle_hours, 'energy_kw'] * 3
df.loc[low_hours, 'cost_cents'] = df.loc[low_hours, 'energy_kw'] * 4
```
Так лучше, так как мы сформировали колонку в которой у нас будет 2 для значений от 0 до 8, 3 для значений от 8 до 16, и 3 для значений от 16 до 24  
и потом просто умножили эту колонку на нашу колонку с киловатами  
```
cents_per_kw = pd.cut(x=df.index.hour,
                      bins=[0, 8, 17, 24],
                      include_lowest=True,
                      labels=[2, 3, 4]).astype(int)
df['cost_cents'] = cents_per_kw * df['energy_kw']
```
*

pandas_profiling

In [ ]:
from pandas_profiling import ProfileReport

df = pd.DataFrame({'number': [3, 1, 2, 1, 4]})
ProfileReport(df)

# если нужно больше информации, то активируем опцию explorative
report = ProfileReport(df, title='My report', explorative=True)

# если нужно ускорить, то можно отказаться от scatterplot
ProfileReport(df, minimal=True)

In [7]:
# Таблицы можно выводить с помощью display
from IPython.display import display
df = pd.DataFrame({'number': [3, 1, 2, 1, 4]})
display(df)

   number
0       3
1       1
2       2
3       1
4       4

По умолчанию датафрейм panda может показывать только ограниченное количество строк и столбцов. Но мы можем изменить значение по умолчанию.  
Вариант 1:

In [ ]:
import pandas as pd

pd.options.display.max_rows = 100
pd.options.display.max_columns = 50

Вариант 2:

In [ ]:
pd.set_option("display.max_rows", 100)
pd.set_option("display.max_columns", 50)

ускорить pandas

In [ ]:
from tqdm.auto import tqdm
tqdm.pandas()

In [8]:
arr = np.random.rand(100_000, 3)
df = pd.DataFrame(arr, columns=['col1', 'col2', 'col3'])
df.head()

       col1      col2      col3
0  0.176631  0.588987  0.282701
1  0.926761  0.841678  0.320499
2  0.651742  0.657272  0.474510
3  0.850902  0.549545  0.507875
4  0.157473  0.345946  0.505806

In [9]:
def func(row):
    return row['col1'] ** row['col2'] / row['col3']
df['res'] = df.progress_apply(func, axis=1)

  0%|          | 0/100000 [00:00<?, ?it/s]

параллельное выполнение в pandas

https://nalepae.github.io/pandarallel/

In [ ]:
!pip install pandarallel

In [ ]:
from pandarallel import pandarallel
from tqdm.auto import tqdm
tqdm.pandas()
pandarallel.initialize(progress_bar=True)

In [31]:
df = pd.DataFrame(
    dict(col1 = ['a' if i < 30 else 'b' for i in range(100)],
    col2 = [i for i in range(100)])
)
df.head()

  col1  col2
0    a     0
1    a     1
2    a     2
3    a     3
4    a     4

In [38]:
def func(row):
    pass
df.groupby('col1').parallel_apply(np.mean)

VBox(children=(HBox(children=(IntProgress(value=0, description='0.00%', max=1), Label(value='0 / 1'))), HBox(c…

      col2
col1
a     14.5
b     64.5

progress_apply показывает время выполнения без разпараллеливания  
(просто покажет бар динамики выполнения)

In [ ]:
def func(row):
    pass
df["sample-word"] = df.progress_apply(func, axis=1)

parallel_apply - распараллеливает apply

In [6]:
def func(row):
    pass
df["sample-word"] = df.parallel_apply(func, axis=1)

VBox(children=(HBox(children=(IntProgress(value=0, description='0.00%', max=50), Label(value='0 / 50'))), HBox…

In [ ]:
import sqlite3
conn = sqlite3.connect('my_database.db')
query = 'SELECT * FROM bookings.aircrafts'
df = pd.read_sql(query, conn)
conn.close()

In [ ]:
import psycopg2

# инициализируем соединение с базой данных
with psycopg2.connect(dbname='demo',
                        user='postgres',
                        host='127.0.0.1',
                        port='5432',
                        password='root') as conn:
    # получаем все строки ответа
    query = 'SELECT * FROM bookings.aircrafts'
    df = pd.read_sql(query, conn)
df.head()

Если нужно записать в базу данных, то нужно использвоать sqlalchemy  
так как df.to_sql работает только с sqlalchemy

In [ ]:
import sqlalchemy as db
 
engine = db.create_engine('dialect+driver://user:pass@host:port/db')
# conn = 'postgresql+psycopg2://readonly:6hajV34RTQfmxhS@dsstudents.skillbox.ru:5432/db_ds_students'
# for mysql dialect+driver = mysql+pymysql
with engine.connect() as connect:
    df.to_sql('Name of SQL table', con=engine, if_exists='append')

In [ ]:
# для тяжелых запросов к MySQL можно использовать SSDictCursor
import pymysql

with pymysql.connect(
                host = 'dbhost',
                port = 3306,
                user = 'dbuser',
                password = 'dbpass',
                db = 'db',
                cursorclass = pymysql.cursors.SSDictCursor) as conn:
    pass

Когда нужно загрузить много файлов и сделать из них дата сеты, то удобно делать так

In [ ]:
import pandas as pd 
# Загрузка файлов 

datasets = ['calls', 'internet', 'messages', 'tariffs', 'users']
dfs = {}
for dataset in datasets:
    dfs[dataset] = pd.read_csv('datasets/' + dataset + '.csv')

Парсинг сайтов   
в match  
указываем любое слово из таблицы, если несколько таблиц с таким словом,   
то все они будут в списке  
pd.read_html возвращает список датафреймов

In [4]:
tables = pd.read_html(
    'https://en.wikipedia.org/wiki/ISO_4217',
    match='code')
tables[0].head()

,Code,Num,D[a],Currency,Locations listed for this currency[b]
0,AED,784,2,United Arab Emirates dirham,United Arab Emirates
1,AFN,971,2,Afghan afghani,Afghanistan
2,ALL,8,2,Albanian lek,Albania
3,AMD,51,2,Armenian dram,Armenia
4,ANG,532,2,Netherlands Antillean guilder,"Curaçao (CW), Sint Maarten (SX)"

In [2]:
df = pd.read_json('test.json')
df.head()

,id,weather_state_name,weather_state_abbr,wind_direction_compass,created,applicable_date,min_temp,max_temp,the_temp,wind_speed,wind_direction,air_pressure,humidity,visibility,predictability
0,4723897926680576,Heavy Rain,hr,NE,2020-06-20T18:28:31.731018Z,2020-06-20,18.675,25.810,24.695,4.646417,40.000000,1014.0,72,14.283460,77
1,5424697472712704,Light Rain,lr,NE,2020-06-20T15:28:31.713244Z,2020-06-20,18.675,25.810,24.695,4.646417,40.000000,1014.0,72,14.283460,75
2,5918873591218176,Light Rain,lr,NNE,2020-06-20T12:28:31.907804Z,2020-06-20,18.980,28.180,27.485,3.746674,27.740008,1014.0,64,14.283460,75
3,5531583773671424,Heavy Rain,hr,NNE,2020-06-20T09:28:32.329702Z,2020-06-20,18.985,28.650,27.440,3.576500,30.292134,1014.0,63,12.658574,77
4,6432472222924800,Light Rain,lr,NE,2020-06-20T06:28:31.423102Z,2020-06-20,18.280,29.665,29.515,3.217347,34.011018,1014.0,56,14.147690,75

Как посмотреть дублирующиеся записи в таблице

In [3]:
df[df.duplicated(keep=False)]

Empty DataFrame
Columns: [id, weather_state_name, weather_state_abbr, wind_direction_compass, created, applicable_date, min_temp, max_temp, the_temp, wind_speed, wind_direction, air_pressure, humidity, visibility, predictability]
Index: []

In [3]:
import json
with open('test.json') as f:
    json_l = json.load(f)
df = pd.json_normalize(json_l)
df.head()

,id,weather_state_name,weather_state_abbr,wind_direction_compass,created,applicable_date,min_temp,max_temp,the_temp,wind_speed,wind_direction,air_pressure,humidity,visibility,predictability
0,4723897926680576,Heavy Rain,hr,NE,2020-06-20T18:28:31.731018Z,2020-06-20,18.675,25.810,24.695,4.646417,40.000000,1014.0,72,14.283460,77
1,5424697472712704,Light Rain,lr,NE,2020-06-20T15:28:31.713244Z,2020-06-20,18.675,25.810,24.695,4.646417,40.000000,1014.0,72,14.283460,75
2,5918873591218176,Light Rain,lr,NNE,2020-06-20T12:28:31.907804Z,2020-06-20,18.980,28.180,27.485,3.746674,27.740008,1014.0,64,14.283460,75
3,5531583773671424,Heavy Rain,hr,NNE,2020-06-20T09:28:32.329702Z,2020-06-20,18.985,28.650,27.440,3.576500,30.292134,1014.0,63,12.658574,77
4,6432472222924800,Light Rain,lr,NE,2020-06-20T06:28:31.423102Z,2020-06-20,18.280,29.665,29.515,3.217347,34.011018,1014.0,56,14.147690,75

In [6]:
df = pd.read_excel('test.xlsx', sheet_name='list_2')

In [7]:
df.head()

,Date,Consumer Price Index for All Urban Consumers: All Items Less Food and Energy in U.S. City Average,10-Year Real Interest Rate,Total Nonfarm Payroll
0,2021-11-01,283.201,0.097715,148611
1,2021-10-01,281.695,0.163998,148401
2,2021-09-01,280.017,0.087901,147855
3,2021-08-01,279.338,-0.194731,147476
4,2021-07-01,279.054,-0.261019,146993

In [14]:

df.to_excel('test.xlsx', sheet_name='list_3', index=None)

In [15]:
with pd.ExcelWriter('test.xlsx', mode='a') as writer:  # doctest: +SKIP
    df.to_excel(writer, sheet_name='Sheet_name_1')
    df.to_excel(writer, sheet_name='Sheet_name_2')

In [ ]:
df = pd.read_csv('wgi_fh.csv', sep=';', decimal=',')

In [3]:
df = pd.DataFrame(list(zip([1,2,3,4], ['2010-04-11', '2010-04-23', '2010-05-03', '2010-05-05'])), columns=['col1', 'date'])
# очень важно писать формат для парсинга даты, так как тогда пандас будет быстрее парсить, ему не нужно будет сравнивать его кучу разных форматов
df.date = pd.to_datetime(df.date, format='%Y-%m-%d')
df = df.set_index('date')
df

            col1
date
2010-04-11     1
2010-04-23     2
2010-05-03     3
2010-05-05     4

In [4]:
df.reset_index(inplace=True)
df['day_name'] = df['date'].dt.day_name()
df

        date  col1   day_name
0 2010-04-11     1     Sunday
1 2010-04-23     2     Friday
2 2010-05-03     3     Monday
3 2010-05-05     4  Wednesday

df.values превращает датафрейм в numpy array

In [5]:
df.values

array([[Timestamp('2010-04-11 00:00:00'), 1, 'Sunday'],
       [Timestamp('2010-04-23 00:00:00'), 2, 'Friday'],
       [Timestamp('2010-05-03 00:00:00'), 3, 'Monday'],
       [Timestamp('2010-05-05 00:00:00'), 4, 'Wednesday']], dtype=object)

Merged columns with known format

разделитель столбцов  
sep=  
десятичный разделитель
decimal=

In [ ]:
df = pd.read_csv(
    infile,
    parse_dates={'mydatetime': ['My Date', 'My Time']},
    # mydatetime will contain my_date and my_time separated by a single space
    date_format={'mydatetime': '%Y-%m-%d %H:%M:%S'}
)

resample группирует по временному промежутку  
на выходе тот же результат как после групп бай, то есть группы  
и мы можем либо агрегировать стандартной функцией, либо использовать apply  
и сделать из группы, что хотим, при чем можем и не схлопывать в apply

In [15]:
df.resample('M').sum()

            col1
date
2010-04-30     3
2010-05-31     7

In [18]:
df = df.reset_index()
df.groupby(df['date'].dt.to_period('M')).agg(my_sum=('col1', 'sum'))

         my_sum
date
2010-04       3
2010-05       7

In [2]:
date_parser = lambda x: pd.datetime.strptime(x, '%Y-%m-%d')
df = pd.read_csv('click_stream.csv', header=None, names = ['ID','page','date', 'device', 'gender'], parse_dates= ['date'], date_parser=date_parser)
# or in latest versions Pandas
# df = pd.read_csv('click_stream.csv', header=None, names = ['ID','page','date', 'device', 'gender'], parse_dates= ['date'], date_format={'My DateTime': '%Y-%m-%d'})
df.head()

c:\python\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: The pandas.datetime class is deprecated and will be removed from pandas in a future version. Import from datetime module instead.
  """Entry point for launching an IPython kernel.

       ID         page       date   device  gender
0  313593  1_home_page 2015-02-26  Desktop  Female
1  468315  1_home_page 2015-02-21  Desktop    Male
2  264005  1_home_page 2015-03-25  Desktop  Female
3  290784  1_home_page 2015-03-14  Desktop    Male
4  639104  1_home_page 2015-01-03  Desktop  Female

Если нужно взять первые знчения из группы,  
при этом порядок определяется несколькими полями,  
то сначала сортируем, а потом группируем

In [3]:
df.sort_values(['date', 'ID']).groupby('device').first()

           ID         page       date  gender
device
Desktop  6386  1_home_page 2015-01-01  Female
Mobile   1659  1_home_page 2015-01-01  Female

In [5]:
df_pivot = df.pivot_table(index=df.date.dt.to_period('M'), columns=['gender', 'device', 'page'], values='ID', aggfunc='count')
df_pivot

gender       Female                                                           \
device      Desktop
page    1_home_page 2_search_page 3_payment_page 4_payment_confirmation_page
date
2015-01        7546          3851            625                          33
2015-02        7448          3800            605                          26
2015-03        7512          3707            162                           6
2015-04        7491          3733            138                           9

gender                                                                        \
device       Mobile
page    1_home_page 2_search_page 3_payment_page 4_payment_confirmation_page
date
2015-01        3868          3062            618                          76
2015-02        3751          3020            630                          60
2015-03        3738           747            175                          20
2015-04        3721           756            147                          11

gender         Male                                                           \
device      Desktop
page    1_home_page 2_search_page 3_payment_page 4_payment_confirmation_page
date
2015-01        7504          3678            596                          27
2015-02        7602          3832            586                          28
2015-03        7538          3663            134                           8
2015-04        7559          3836            164                          13

gender
device       Mobile
page    1_home_page 2_search_page 3_payment_page 4_payment_confirmation_page
date
2015-01        3682          2963            551                          53
2015-02        3799          3035            591                          59
2015-03        3812           762            160                          10
2015-04        3829           755            148                          13

In [6]:
df_pivot.droplevel(1, axis=1)

gender       Female                                                           \
page    1_home_page 2_search_page 3_payment_page 4_payment_confirmation_page
date
2015-01        7546          3851            625                          33
2015-02        7448          3800            605                          26
2015-03        7512          3707            162                           6
2015-04        7491          3733            138                           9

gender                                                                        \
page    1_home_page 2_search_page 3_payment_page 4_payment_confirmation_page
date
2015-01        3868          3062            618                          76
2015-02        3751          3020            630                          60
2015-03        3738           747            175                          20
2015-04        3721           756            147                          11

gender         Male                                                           \
page    1_home_page 2_search_page 3_payment_page 4_payment_confirmation_page
date
2015-01        7504          3678            596                          27
2015-02        7602          3832            586                          28
2015-03        7538          3663            134                           8
2015-04        7559          3836            164                          13

gender
page    1_home_page 2_search_page 3_payment_page 4_payment_confirmation_page
date
2015-01        3682          2963            551                          53
2015-02        3799          3035            591                          59
2015-03        3812           762            160                          10
2015-04        3829           755            148                          13

In [6]:
df_pivot.columns.levels[0]

Index(['Female', 'Male'], dtype='object', name='gender')

In [7]:
df_pivot.columns.levels[1]

Index(['Desktop', 'Mobile'], dtype='object', name='device')

In [4]:
df_pivot[('Female', 'Desktop')]

page,1_home_page,2_search_page,3_payment_page,4_payment_confirmation_page
date,,,,
2015-01,7546,3851,625,33
2015-02,7448,3800,605,26
2015-03,7512,3707,162,6
2015-04,7491,3733,138,9

In [8]:
for gender in df_pivot.columns.levels[0]:
    for device in df_pivot.columns.levels[1]:
        df_pivot[(gender, device)] = df_pivot[(gender, device)].apply(lambda x: round(x / x[0] * 100, 2), axis=1).copy()
df_pivot

gender       Female                                                           \
device      Desktop
page    1_home_page 2_search_page 3_payment_page 4_payment_confirmation_page
date
2015-01       100.0         51.03           8.28                        0.44
2015-02       100.0         51.02           8.12                        0.35
2015-03       100.0         49.35           2.16                        0.08
2015-04       100.0         49.83           1.84                        0.12

gender                                                                        \
device       Mobile
page    1_home_page 2_search_page 3_payment_page 4_payment_confirmation_page
date
2015-01       100.0         79.16          15.98                        1.96
2015-02       100.0         80.51          16.80                        1.60
2015-03       100.0         19.98           4.68                        0.54
2015-04       100.0         20.32           3.95                        0.30

gender         Male                                                           \
device      Desktop
page    1_home_page 2_search_page 3_payment_page 4_payment_confirmation_page
date
2015-01       100.0         49.01           7.94                        0.36
2015-02       100.0         50.41           7.71                        0.37
2015-03       100.0         48.59           1.78                        0.11
2015-04       100.0         50.75           2.17                        0.17

gender
device       Mobile
page    1_home_page 2_search_page 3_payment_page 4_payment_confirmation_page
date
2015-01       100.0         80.47          14.96                        1.44
2015-02       100.0         79.89          15.56                        1.55
2015-03       100.0         19.99           4.20                        0.26
2015-04       100.0         19.72           3.87                        0.34

In [9]:
pd.concat([df_pivot[('Female', 'Desktop')], df_pivot[('Male', 'Desktop')]], axis=1, keys=['Female', 'Male'])

             Female                                                           \
page    1_home_page 2_search_page 3_payment_page 4_payment_confirmation_page
date
2015-01       100.0         51.03           8.28                        0.44
2015-02       100.0         51.02           8.12                        0.35
2015-03       100.0         49.35           2.16                        0.08
2015-04       100.0         49.83           1.84                        0.12

               Male
page    1_home_page 2_search_page 3_payment_page 4_payment_confirmation_page
date
2015-01       100.0         49.01           7.94                        0.36
2015-02       100.0         50.41           7.71                        0.37
2015-03       100.0         48.59           1.78                        0.11
2015-04       100.0         50.75           2.17                        0.17

In [4]:
df[3:5]

       ID         page       date   device  gender
3  290784  1_home_page 2015-03-14  Desktop    Male
4  639104  1_home_page 2015-01-03  Desktop  Female

In [2]:
tmp = pd.DataFrame({'a': [[1,2,3], [11, 22, 33], [111, 222, 333]]})
tmp

                 a
0        [1, 2, 3]
1     [11, 22, 33]
2  [111, 222, 333]

In [3]:
tmp = tmp['a'].apply(lambda x: pd.Series(x))
tmp

     0    1    2
0    1    2    3
1   11   22   33
2  111  222  333

In [4]:
tmp.sort_values([0, 2], ascending=(True, False))

     0    1    2
0    1    2    3
1   11   22   33
2  111  222  333

In [5]:
tmp = tmp.T.unstack().reset_index(level=1, drop=True).to_frame().rename({0: 'a'}, axis=1)
tmp

     a
0    1
0    2
0    3
1   11
1   22
1   33
2  111
2  222
2  333

В обратную сторону

In [7]:
tmp = tmp.reset_index().rename({'index': 'my_col'}, axis=1)
tmp.head()

   my_col   a
0       0   1
1       0   2
2       0   3
3       1  11
4       1  22

In [8]:
tmp.groupby('my_col').agg(lambda x: list(x))

                      a
my_col
0             [1, 2, 3]
1          [11, 22, 33]
2       [111, 222, 333]

In [26]:
def func(x):
    return list(x)
tmp.groupby('my_col').agg(func)

                      a
my_col
0             [1, 2, 3]
1          [11, 22, 33]
2       [111, 222, 333]

In [3]:
pdd = pd.DataFrame([1,2,3], index=['r1', 'r1', 'r3'], columns=['A'])
pdd

    A
r1  1
r1  2
r3  3

In [8]:
pdd['A']

r1    1
r1    2
r3    3
Name: A, dtype: int64

In [ ]:
pdd.columns = ['B']
pdd.index = ['a', 'b', 3]
pdd

In [94]:
df = df.drop('date', axis=1)
df.head()

       ID         page   device  gender
0  313593  1_home_page  Desktop  Female
1  468315  1_home_page  Desktop    Male
2  264005  1_home_page  Desktop  Female
3  290784  1_home_page  Desktop    Male
4  639104  1_home_page  Desktop  Female

In [93]:
new_index = ['row1', 'row2'] + df.index.to_list()
new_columns = df.columns[:2].to_list() + ['my_col1', 'my_col2'] + df.columns[2:].to_list()

In [95]:
df.reindex(index=new_index, fill_value=0, columns=new_columns)

,ID,page,my_col1,my_col2,date,device,gender
row1,0,0,0,0,0,0,0
row2,0,0,0,0,0,0,0
0,313593,1_home_page,0,0,0,Desktop,Female
1,468315,1_home_page,0,0,0,Desktop,Male
2,264005,1_home_page,0,0,0,Desktop,Female
...,...,...,...,...,...,...,...
142077,397473,4_payment_confirmation_page,0,0,0,Mobile,Female
142078,860829,4_payment_confirmation_page,0,0,0,Mobile,Female
142079,371291,4_payment_confirmation_page,0,0,0,Mobile,Female
142080,263707,4_payment_confirmation_page,0,0,0,Mobile,Female
142081,892101,4_payment_confirmation_page,0,0,0,Desktop,Male

In [43]:
df.index = df.device
df.head()

        device         page   gender      ID
device
313593  313593  1_home_page  Desktop  Female
468315  468315  1_home_page  Desktop    Male
264005  264005  1_home_page  Desktop  Female
290784  290784  1_home_page  Desktop    Male
639104  639104  1_home_page  Desktop  Female

У текстовых срезов правый конец включается

In [46]:
df.loc[:, 'page':'gender']

                               page   gender
device
313593                  1_home_page  Desktop
468315                  1_home_page  Desktop
264005                  1_home_page  Desktop
290784                  1_home_page  Desktop
639104                  1_home_page  Desktop
...                             ...      ...
397473  4_payment_confirmation_page   Mobile
860829  4_payment_confirmation_page   Mobile
371291  4_payment_confirmation_page   Mobile
263707  4_payment_confirmation_page   Mobile
892101  4_payment_confirmation_page  Desktop

[142082 rows x 2 columns]

In [ ]:
pdd[['C', 'D']] = pd.DataFrame([[11,111], [22, 222], [33, 333]], index=['a', 'b', 3])
pdd

In [54]:
pdd.loc['a':'b', 'C':'D']

    C    D
a  11  111
b  22  222

In [55]:
pdd.loc[['a', 3], ['B', 'D']]

   B    D
a  1  111
3  3  333

In [56]:
pdd.loc['a':'b', ['B', 'D']]

   B    D
a  1  111
b  2  222

In [3]:
df[['col1', 'col2', 'col3', 'col4']] = 1, 2, 3, 4
df.head()

       ID         page       date   device  gender  col1  col2  col3  col4
0  313593  1_home_page 2015-02-26  Desktop  Female     1     2     3     4
1  468315  1_home_page 2015-02-21  Desktop    Male     1     2     3     4
2  264005  1_home_page 2015-03-25  Desktop  Female     1     2     3     4
3  290784  1_home_page 2015-03-14  Desktop    Male     1     2     3     4
4  639104  1_home_page 2015-01-03  Desktop  Female     1     2     3     4

In [97]:
df.loc[:, 'col1':'col3'].apply(np.log).head()

   col1      col2      col3
0   0.0  0.693147  1.098612
1   0.0  0.693147  1.098612
2   0.0  0.693147  1.098612
3   0.0  0.693147  1.098612
4   0.0  0.693147  1.098612

In [69]:
df.loc[:, 'col1':'col3'].mean(axis=0).head()

col1    1.0
col2    2.0
col3    3.0
dtype: float64

In [73]:
df.loc[:, 'col1':'col3'].mean(axis=1).head()

device
313593    2.0
468315    2.0
264005    2.0
290784    2.0
639104    2.0
dtype: float64

In [75]:
df.loc[:, 'col1':'col3'].sum(axis=0).head()

col1    142082
col2    284164
col3    426246
dtype: int64

In [77]:
df.loc[:, 'col1':'col3'].count(axis=0).head()

col1    142082
col2    142082
col3    142082
dtype: int64

In [78]:
df.loc[:, 'col1':'col3'].count(axis=1).head()

device
313593    3
468315    3
264005    3
290784    3
639104    3
dtype: int64

In [86]:
df.loc[:, 'col1':'col3'].apply(lambda x: x.max() - x.min(), axis=1).head()

device
313593    2
468315    2
264005    2
290784    2
639104    2
dtype: int64

In [89]:
def func(x):
    print(type(x))
df.loc[:, ['col1','col3']].apply(func).head()

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

col1    None
col3    None
dtype: object

groupby создает объект генератор, который генерирует список пар коретежей  
каждый кортеж состоит из уникального значения группы (когда мы группируем, то у нас получаются уникальные значения)  
и датафрейм для этой группы

In [99]:
list(df.groupby('device'))

[('Desktop',
              ID                         page   device  gender  col1  col2  \
  0       313593                  1_home_page  Desktop  Female     1     2
  1       468315                  1_home_page  Desktop    Male     1     2
  2       264005                  1_home_page  Desktop  Female     1     2
  3       290784                  1_home_page  Desktop    Male     1     2
  4       639104                  1_home_page  Desktop  Female     1     2
  ...        ...                          ...      ...     ...   ...   ...
  142065  572199  4_payment_confirmation_page  Desktop    Male     1     2
  142066  604207  4_payment_confirmation_page  Desktop    Male     1     2
  142068  779484  4_payment_confirmation_page  Desktop  Female     1     2
  142074  131772  4_payment_confirmation_page  Desktop    Male     1     2
  142081  892101  4_payment_confirmation_page  Desktop    Male     1     2

          col3  col4
  0          3     4
  1          3     4
  2          3     4
  3          3     4
  4          3     4
  ...      ...   ...
  142065     3     4
  142066     3     4
  142068     3     4
  142074     3     4
  142081     3     4

  [93460 rows x 8 columns]),
 ('Mobile',
              ID                         page  device  gender  col1  col2  col3  \
  5       262889                  1_home_page  Mobile    Male     1     2     3
  6       708793                  1_home_page  Mobile  Female     1     2     3
  8       417894                  1_home_page  Mobile  Female     1     2     3
  10      188061                  1_home_page  Mobile  Female     1     2     3
  12      351103                  1_home_page  Mobile    Male     1     2     3
  ...        ...                          ...     ...     ...   ...   ...   ...
  142076  234188  4_payment_confirmation_page  Mobile    Male     1     2     3
  142077  397473  4_payment_confirmation_page  Mobile  Female     1     2     3
  142078  860829  4_payment_confirmation_page  Mobile  Female     1     2     3
  142079  371291  4_payment_confirmation_page  Mobile  Female     1     2     3
  142080  263707  4_payment_confirmation_page  Mobile  Female     1     2     3

          col4
  5          4
  6          4
  8          4
  10         4
  12         4
  ...      ...
  142076     4
  142077     4
  142078     4
  142079     4
  142080     4

  [48622 rows x 8 columns])]

In [100]:
list(df.groupby('device'))[0]

('Desktop',
             ID                         page   device  gender  col1  col2  \
 0       313593                  1_home_page  Desktop  Female     1     2
 1       468315                  1_home_page  Desktop    Male     1     2
 2       264005                  1_home_page  Desktop  Female     1     2
 3       290784                  1_home_page  Desktop    Male     1     2
 4       639104                  1_home_page  Desktop  Female     1     2
 ...        ...                          ...      ...     ...   ...   ...
 142065  572199  4_payment_confirmation_page  Desktop    Male     1     2
 142066  604207  4_payment_confirmation_page  Desktop    Male     1     2
 142068  779484  4_payment_confirmation_page  Desktop  Female     1     2
 142074  131772  4_payment_confirmation_page  Desktop    Male     1     2
 142081  892101  4_payment_confirmation_page  Desktop    Male     1     2

         col3  col4
 0          3     4
 1          3     4
 2          3     4
 3          3     4
 4          3     4
 ...      ...   ...
 142065     3     4
 142066     3     4
 142068     3     4
 142074     3     4
 142081     3     4

 [93460 rows x 8 columns])

Следовательно мы можем перебирать в цикле обект после группировки

In [102]:
for val, df_in in df.groupby('device'):
    print(f'val = {val}')
    print(f'df_in = \n{df_in}')
    break

val = Desktop
df_in =
            ID                         page   device  gender  col1  col2  \
0       313593                  1_home_page  Desktop  Female     1     2
1       468315                  1_home_page  Desktop    Male     1     2
2       264005                  1_home_page  Desktop  Female     1     2
3       290784                  1_home_page  Desktop    Male     1     2
4       639104                  1_home_page  Desktop  Female     1     2
...        ...                          ...      ...     ...   ...   ...
142065  572199  4_payment_confirmation_page  Desktop    Male     1     2
142066  604207  4_payment_confirmation_page  Desktop    Male     1     2
142068  779484  4_payment_confirmation_page  Desktop  Female     1     2
142074  131772  4_payment_confirmation_page  Desktop    Male     1     2
142081  892101  4_payment_confirmation_page  Desktop    Male     1     2

        col3  col4
0          3     4
1          3     4
2          3     4
3          3     4
4          3     4
...      ...   ...
142065     3     4
142066     3     4
142068     3     4
142074     3     4
142081     3     4

[93460 rows x 8 columns]

Когда мы после groupby пишем сразу методы или используем agg,  
то мы применяем этот метод или аггрегацию отдельно к каждому датафрейму для каждого значения группы

In [105]:
df.groupby('device').sum()

                  ID   col1    col2    col3    col4
device
Desktop  46573967322  93460  186920  280380  373840
Mobile   24239678005  48622   97244  145866  194488

In [113]:
df.groupby('device').agg('sum')

                  ID   col1    col2    col3    col4
device
Desktop  46573967322  93460  186920  280380  373840
Mobile   24239678005  48622   97244  145866  194488

In [111]:
df.groupby('device').agg({'col1': 'sum'})

          col1
device
Desktop  93460
Mobile   48622

In [110]:
df.groupby('device').agg(my_sum=('col1', 'sum'))

         my_sum
device
Desktop   93460
Mobile    48622

In [120]:
def func(x):
    print(type(x), ' ', x.name)
df.groupby('device').agg(func)

<class 'pandas.core.series.Series'>   ID
<class 'pandas.core.series.Series'>   ID
<class 'pandas.core.series.Series'>   page
<class 'pandas.core.series.Series'>   page
<class 'pandas.core.series.Series'>   gender
<class 'pandas.core.series.Series'>   gender
<class 'pandas.core.series.Series'>   col1
<class 'pandas.core.series.Series'>   col1
<class 'pandas.core.series.Series'>   col2
<class 'pandas.core.series.Series'>   col2
<class 'pandas.core.series.Series'>   col3
<class 'pandas.core.series.Series'>   col3
<class 'pandas.core.series.Series'>   col4
<class 'pandas.core.series.Series'>   col4

           ID  page gender  col1  col2  col3  col4
device
Desktop  None  None   None  None  None  None  None
Mobile   None  None   None  None  None  None  None

In [139]:
def func(x):
    if x.name in ['ID', 'page', 'gender']:
        return x.value_counts()[0]
    else:
        return x.sum()
df.groupby('device').agg(func)

                  ID   page  gender   col1    col2    col3    col4
device
Desktop  46573967322  60200   46768  93460  186920  280380  373840
Mobile   24239678005  30200   24400  48622   97244  145866  194488

In [142]:

def func(x):
    if x.name in ['ID', 'page', 'gender']:
        return x.value_counts()[0]
    else:
        return x.sum()
df.groupby('device').agg(
    ID_mode=('ID', func)
    , page_mode=('page', func)
    , gender_mode=('gender', func)
    , col1_sum=('col1', func)
    , col2_sum=('col2', func)
    , col3_sum=('col3', func)
    
)

             ID_mode  page_mode  gender_mode  col1_sum  col2_sum  col3_sum
device
Desktop  46573967322      60200        46768     93460    186920    280380
Mobile   24239678005      30200        24400     48622     97244    145866

In [4]:
def func(x):
    print(type(x), ' ', x.name)
df.groupby('device').agg(new_col=('col1', func), new_col2=('col2', pd.Series.mode))

<class 'pandas.core.series.Series'>   col1
<class 'pandas.core.series.Series'>   col1

        new_col  new_col2
device
Desktop    None         2
Mobile     None         2

In [5]:
df.groupby('device')['col1'].agg(agg_col1='mean', agg_col2='median', agg_col3='sum')

         agg_col1  agg_col2  agg_col3
device
Desktop       1.0       1.0     93460
Mobile        1.0       1.0     48622

In [143]:
df.head()

       ID         page   device  gender  col1  col2  col3  col4
0  313593  1_home_page  Desktop  Female     1     2     3     4
1  468315  1_home_page  Desktop    Male     1     2     3     4
2  264005  1_home_page  Desktop  Female     1     2     3     4
3  290784  1_home_page  Desktop    Male     1     2     3     4
4  639104  1_home_page  Desktop  Female     1     2     3     4

In [147]:
df_reindex = df.set_index(['device', 'gender', 'page'])
df_reindex.head()

                                ID  col1  col2  col3  col4
device  gender page
Desktop Female 1_home_page  313593     1     2     3     4
        Male   1_home_page  468315     1     2     3     4
        Female 1_home_page  264005     1     2     3     4
        Male   1_home_page  290784     1     2     3     4
        Female 1_home_page  639104     1     2     3     4

In [150]:
df_reindex.index[:5]

MultiIndex([('Desktop', 'Female', '1_home_page'),
            ('Desktop',   'Male', '1_home_page'),
            ('Desktop', 'Female', '1_home_page'),
            ('Desktop',   'Male', '1_home_page'),
            ('Desktop', 'Female', '1_home_page')],
           names=['device', 'gender', 'page'])

In [155]:
df_reindex.loc['Desktop'].head()

                        ID  col1  col2  col3  col4
gender page
Female 1_home_page  313593     1     2     3     4
Male   1_home_page  468315     1     2     3     4
Female 1_home_page  264005     1     2     3     4
Male   1_home_page  290784     1     2     3     4
Female 1_home_page  639104     1     2     3     4

In [183]:
df_reindex.loc[['Desktop']].head()

                                ID  col1  col2  col3  col4
device  gender page
Desktop Female 1_home_page  313593     1     2     3     4
        Male   1_home_page  468315     1     2     3     4
        Female 1_home_page  264005     1     2     3     4
        Male   1_home_page  290784     1     2     3     4
        Female 1_home_page  639104     1     2     3     4

In [159]:
df_reindex.loc['Desktop', 'Male'].head()

c:\python\lib\site-packages\ipykernel_launcher.py:1: PerformanceWarning: indexing past lexsort depth may impact performance.
  """Entry point for launching an IPython kernel.

                 ID  col1  col2  col3  col4
page
1_home_page  468315     1     2     3     4
1_home_page  290784     1     2     3     4
1_home_page  943143     1     2     3     4
1_home_page  729374     1     2     3     4
1_home_page  899940     1     2     3     4

In [164]:
df_reindex.loc['Desktop'].loc['Male'].head()

                 ID  col1  col2  col3  col4
page
1_home_page  468315     1     2     3     4
1_home_page  290784     1     2     3     4
1_home_page  943143     1     2     3     4
1_home_page  729374     1     2     3     4
1_home_page  899940     1     2     3     4

In [174]:
df_reindex.loc[(['Desktop', 'Mobile'], ['Male', 'Female'], '1_home_page')]

                                ID  col1  col2  col3  col4
device  gender page
Desktop Male   1_home_page  468315     1     2     3     4
               1_home_page  290784     1     2     3     4
               1_home_page  943143     1     2     3     4
               1_home_page  729374     1     2     3     4
               1_home_page  899940     1     2     3     4
...                            ...   ...   ...   ...   ...
Mobile  Female 1_home_page  787726     1     2     3     4
               1_home_page  778498     1     2     3     4
               1_home_page  527712     1     2     3     4
               1_home_page  836673     1     2     3     4
               1_home_page  272782     1     2     3     4

[90400 rows x 5 columns]

In [180]:
df_reindex.reset_index(level=1)

                                     gender      ID  col1  col2  col3  col4
device  page
Desktop 1_home_page                  Female  313593     1     2     3     4
        1_home_page                    Male  468315     1     2     3     4
        1_home_page                  Female  264005     1     2     3     4
        1_home_page                    Male  290784     1     2     3     4
        1_home_page                  Female  639104     1     2     3     4
...                                     ...     ...   ...   ...   ...   ...
Mobile  4_payment_confirmation_page  Female  397473     1     2     3     4
        4_payment_confirmation_page  Female  860829     1     2     3     4
        4_payment_confirmation_page  Female  371291     1     2     3     4
        4_payment_confirmation_page  Female  263707     1     2     3     4
Desktop 4_payment_confirmation_page    Male  892101     1     2     3     4

[142082 rows x 6 columns]

In [181]:
df_reindex.sort_index()

                                                ID  col1  col2  col3  col4
device  gender page
Desktop Female 1_home_page                  313593     1     2     3     4
               1_home_page                  264005     1     2     3     4
               1_home_page                  639104     1     2     3     4
               1_home_page                  223223     1     2     3     4
               1_home_page                  819741     1     2     3     4
...                                            ...   ...   ...   ...   ...
Mobile  Male   4_payment_confirmation_page  169165     1     2     3     4
               4_payment_confirmation_page  211983     1     2     3     4
               4_payment_confirmation_page  436153     1     2     3     4
               4_payment_confirmation_page   86629     1     2     3     4
               4_payment_confirmation_page  234188     1     2     3     4

[142082 rows x 5 columns]

In [182]:
df_reindex.sort_index(level=2)

                                                ID  col1  col2  col3  col4
device  gender page
Desktop Female 1_home_page                  313593     1     2     3     4
               1_home_page                  264005     1     2     3     4
               1_home_page                  639104     1     2     3     4
               1_home_page                  223223     1     2     3     4
               1_home_page                  819741     1     2     3     4
...                                            ...   ...   ...   ...   ...
Mobile  Male   4_payment_confirmation_page  169165     1     2     3     4
               4_payment_confirmation_page  211983     1     2     3     4
               4_payment_confirmation_page  436153     1     2     3     4
               4_payment_confirmation_page   86629     1     2     3     4
               4_payment_confirmation_page  234188     1     2     3     4

[142082 rows x 5 columns]

# pipe

https://pdpipe.github.io/pdpipe/doc/pdpipe/

Три основных инструмента: pipe, assign и query.

In [ ]:
!pip install pdpipe

In [ ]:
import pdpipe as pdp

In [ ]:
If you have
>>> func(g(h(df), arg1=a), arg2=b, arg3=c)  # doctest: +SKIP
You can write

>>> (df.pipe(h)
...    .pipe(g, arg1=a)
...    .pipe(func, arg2=b, arg3=c)
... )  # doctest: +SKIP

In [4]:
df.head()

       ID         page       date   device  gender
0  313593  1_home_page 2015-02-26  Desktop  Female
1  468315  1_home_page 2015-02-21  Desktop    Male
2  264005  1_home_page 2015-03-25  Desktop  Female
3  290784  1_home_page 2015-03-14  Desktop    Male
4  639104  1_home_page 2015-01-03  Desktop  Female

In [6]:
# function to find mean
def f1(dataframe, col):
   
    # groups the data by a column and 
    # returns the mean age per group
    return dataframe.groupby(col).count()
   
# function to convert to uppercase
def f2(dataframe):
   
    # Converts all the column names into uppercase
    dataframe.columns = dataframe.columns.str.upper()
     
    # And returns them
    return dataframe

In [7]:
pipeline = df.pipe(f1, col='gender').pipe(f2)

In [8]:
pipeline

           ID   PAGE   DATE  DEVICE
gender
Female  71092  71092  71092   71092
Male    70990  70990  70990   70990

In [10]:
df.head()

       ID         page       date   device  gender
0  313593  1_home_page 2015-02-26  Desktop  Female
1  468315  1_home_page 2015-02-21  Desktop    Male
2  264005  1_home_page 2015-03-25  Desktop  Female
3  290784  1_home_page 2015-03-14  Desktop    Male
4  639104  1_home_page 2015-01-03  Desktop  Female

In [ ]:
df.gender.str.c

In [20]:
df.assign(
    new_col1 = df.ID * 2 + 1
    , newcol2 = lambda _df: _df['page'].str.upper()
    , new_col3 = 'pandas'
    # если в названии новой колонки нужен пробел, то используем словарь
    , **{"new col4": 'pipe'}
).head()

,ID,page,date,device,gender,new_col1,newcol2,new_col3,new col4
0,313593,1_home_page,2015-02-26,Desktop,Female,627187,1_HOME_PAGE,pandas,pipe
1,468315,1_home_page,2015-02-21,Desktop,Male,936631,1_HOME_PAGE,pandas,pipe
2,264005,1_home_page,2015-03-25,Desktop,Female,528011,1_HOME_PAGE,pandas,pipe
3,290784,1_home_page,2015-03-14,Desktop,Male,581569,1_HOME_PAGE,pandas,pipe
4,639104,1_home_page,2015-01-03,Desktop,Female,1278209,1_HOME_PAGE,pandas,pipe

In [23]:
df.query("gender == 'Female'").head()

       ID         page       date   device  gender
0  313593  1_home_page 2015-02-26  Desktop  Female
2  264005  1_home_page 2015-03-25  Desktop  Female
4  639104  1_home_page 2015-01-03  Desktop  Female
6  708793  1_home_page 2015-04-24   Mobile  Female
8  417894  1_home_page 2015-04-02   Mobile  Female

In [24]:
df.query("ID.isin([468315, 290784])").head()

       ID         page       date   device gender
1  468315  1_home_page 2015-02-21  Desktop   Male
3  290784  1_home_page 2015-03-14  Desktop   Male

where заменяет на nan значения, где False  
и заполнитель уже заполняет эти False

In [28]:
df.where(df.gender == 'Male', 7).head()

       ID         page                 date   device gender
0       7            7                    7        7      7
1  468315  1_home_page  2015-02-21 00:00:00  Desktop   Male
2       7            7                    7        7      7
3  290784  1_home_page  2015-03-14 00:00:00  Desktop   Male
4       7            7                    7        7      7

Проще запонить, что mask это инверсия where  
mask ставить nan, где условие Тrue  
и потом их заполняет заполнителем

In [29]:
df.mask(df.gender == 'Male').head()

         ID         page       date   device  gender
0  313593.0  1_home_page 2015-02-26  Desktop  Female
1       NaN          NaN        NaT      NaN     NaN
2  264005.0  1_home_page 2015-03-25  Desktop  Female
3       NaN          NaN        NaT      NaN     NaN
4  639104.0  1_home_page 2015-01-03  Desktop  Female

In [30]:
df.mask(df.gender == 'Male', 7).head()

       ID         page                 date   device  gender
0  313593  1_home_page  2015-02-26 00:00:00  Desktop  Female
1       7            7                    7        7       7
2  264005  1_home_page  2015-03-25 00:00:00  Desktop  Female
3       7            7                    7        7       7
4  639104  1_home_page  2015-01-03 00:00:00  Desktop  Female

In [36]:
df.ID.where(df.gender == 'Male', -df.ID).head()

0   -313593
1    468315
2   -264005
3    290784
4   -639104
Name: ID, dtype: int64

# Add column level <a class="anchor" id="add-column-level"></a>

In [192]:
df = pd.DataFrame(index=list('abcde'), data={'A': range(5), 'B': range(5), 'C': range(5), 'D': range(5)})
df

   A  B  C  D
a  0  0  0  0
b  1  1  1  1
c  2  2  2  2
d  3  3  3  3
e  4  4  4  4

In [193]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

Если имеем только один уроверь

In [194]:
df.columns = [df.columns, ['AA', 'BB', 'AC', 'AA']]
df

   A  B  C  D
  AA BB AC AA
a  0  0  0  0
b  1  1  1  1
c  2  2  2  2
d  3  3  3  3
e  4  4  4  4

In [195]:
df.columns

MultiIndex([('A', 'AA'),
            ('B', 'BB'),
            ('C', 'AC'),
            ('D', 'AA')],
           )

Если уровней не 1, то писать df.columns нельзя,  
так как это уже мульти, но можно вручную устанавливать любые значения в индексе

In [201]:
df.columns = [['A', 'B', 'C', 'D'], ['AA', 'AA', 'CC', 'DD']]
df

   A  B  C  D
  AA AA CC DD
a  0  0  0  0
b  1  1  1  1
c  2  2  2  2
d  3  3  3  3
e  4  4  4  4

In [225]:
df.columns = [
        ['A', 'A', 'C', 'D']
        , ['AC', 'AA', 'AA', 'AC']
        , [1, 2 ,3, 4]
]
df

   A     C  D
  AC AA AA AC
   1  2  3  4
a  0  0  0  0
b  1  1  1  1
c  2  2  2  2
d  3  3  3  3
e  4  4  4  4

In [228]:
df.index = [
    [11, 22, 33, 44, 55]
    , ['a', 'b', 'c', 'd', 'e']
    , ['aa', 'bb', 'cc', 'dd', 'ee']
]
df

        AA     1 11
        CA     2 22
         F  T  3 33
         P  P  4 44
         O  O  5 55
11 a aa  0  0  0  0
22 b bb  1  1  1  1
33 c cc  2  2  2  2
44 d dd  3  3  3  3
55 e ee  4  4  4  4

Если уже мультииндекс, то можно

In [204]:
df.columns = df.columns.set_levels(['AA', 'BB', 'AC', 'AB'], level=0)
df

  AA BB AC AB
  AA AA CC DD
a  0  0  0  0
b  1  1  1  1
c  2  2  2  2
d  3  3  3  3
e  4  4  4  4

In [205]:
df.swaplevel(0, 1, 1)

  AA    CC DD
  AA BB AC AB
a  0  0  0  0
b  1  1  1  1
c  2  2  2  2
d  3  3  3  3
e  4  4  4  4

In [226]:
multi = [('AA', 'CA', 'F', 'P', 'O')
         , ('AA', 'CA', 'T', 'P', 'O')
         , (1, 2, 3, 4, 5)
         , (11, 22, 33, 44, 55)]
df.columns = pd.MultiIndex.from_tuples(multi)
df

  AA     1 11
  CA     2 22
   F  T  3 33
   P  P  4 44
   O  O  5 55
a  0  0  0  0
b  1  1  1  1
c  2  2  2  2
d  3  3  3  3
e  4  4  4  4

# Stack <a class="anchor" id="stack"></a>

In [256]:
import pandas as pd
import numpy as np
from random import randint, sample
from itertools import combinations
tmp = 'abcdefghij'
a = [' '.join(sample(tmp, randint(2,9))) for _ in range(9)]
id = [i for i in range(11,100,11)]
df = pd.DataFrame({'id': id, 'desc': a})
df

   id               desc
0  11                a c
1  22      g h a f i j b
2  33  h b i g c j e a d
3  44                i c
4  55            a c e i
5  66            h c i g
6  77        f c a b e g
7  88                f h
8  99              h a e

In [257]:
# создание списка пар различных товаров из списка покупок в чеке
df.desc = df.desc.map(lambda x: list(combinations(x.split(), 2)))
 
# количество чеков
df['cnt'] = 1

In [236]:
df

   id                                               desc  cnt
0  11  [(f, i), (f, e), (f, a), (f, b), (f, d), (f, j...    1
1  22                                           [(b, a)]    1
2  33   [(c, e), (c, a), (c, g), (e, a), (e, g), (a, g)]    1
3  44  [(e, d), (e, h), (e, a), (e, b), (e, f), (e, j...    1
4  55  [(h, b), (h, c), (h, g), (h, e), (h, d), (h, i...    1
5  66  [(j, i), (j, h), (j, c), (j, b), (j, e), (j, a...    1
6  77  [(a, f), (a, d), (a, b), (a, j), (f, d), (f, b...    1
7  88  [(h, f), (h, a), (h, d), (h, e), (h, g), (h, b...    1
8  99  [(f, i), (f, d), (f, j), (f, b), (f, e), (i, d...    1

In [258]:
# "развертывание" списка в строке по строкам фрейма
def func(x):
    new_cols = ['id'] + [f'col_{i}' for i in range(len(x['desc']))] + ['cnt']
    new_series = [x['id']] + x['desc'] + [x['cnt']]
    return pd.Series(new_series, index=new_cols)
df = df.apply(func, axis=1)
df.head()

,cnt,col_0,col_1,col_10,col_11,col_12,col_13,col_14,col_15,col_16,...,col_33,col_34,col_35,col_4,col_5,col_6,col_7,col_8,col_9,id
0,1,"(a, c)",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,11
1,1,"(g, h)","(g, a)","(h, b)","(a, f)","(a, i)","(a, j)","(a, b)","(f, i)","(f, j)",...,NaN,NaN,NaN,"(g, j)","(g, b)","(h, a)","(h, f)","(h, i)","(h, j)",22
2,1,"(h, b)","(h, i)","(b, c)","(b, j)","(b, e)","(b, a)","(b, d)","(i, g)","(i, c)",...,"(e, a)","(e, d)","(a, d)","(h, j)","(h, e)","(h, a)","(h, d)","(b, i)","(b, g)",33
3,1,"(i, c)",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,44
4,1,"(a, c)","(a, e)",NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,"(c, i)","(e, i)",NaN,NaN,NaN,NaN,55

In [259]:
df = df.set_index(['cnt', 'id'], append=True)
df.head()

,,,col_0,col_1,col_10,col_11,col_12,col_13,col_14,col_15,col_16,col_17,...,col_32,col_33,col_34,col_35,col_4,col_5,col_6,col_7,col_8,col_9
,cnt,id,,,,,,,,,,,,,,,,,,,,,
0,1,11,"(a, c)",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1,22,"(g, h)","(g, a)","(h, b)","(a, f)","(a, i)","(a, j)","(a, b)","(f, i)","(f, j)","(f, b)",...,NaN,NaN,NaN,NaN,"(g, j)","(g, b)","(h, a)","(h, f)","(h, i)","(h, j)"
2,1,33,"(h, b)","(h, i)","(b, c)","(b, j)","(b, e)","(b, a)","(b, d)","(i, g)","(i, c)","(i, j)",...,"(j, d)","(e, a)","(e, d)","(a, d)","(h, j)","(h, e)","(h, a)","(h, d)","(b, i)","(b, g)"
3,1,44,"(i, c)",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,1,55,"(a, c)","(a, e)",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,"(c, i)","(e, i)",NaN,NaN,NaN,NaN

In [261]:
df = df.stack()
df.head()

   cnt  id
0  1    11  col_0     (a, c)
1  1    22  col_0     (g, h)
            col_1     (g, a)
            col_10    (h, b)
            col_11    (a, f)
dtype: object

In [267]:
df = df.reset_index(level=3, drop=True).reset_index('cnt').set_index(0, append=True)
df.head()

             cnt
  id 0
0 11 (a, c)    1
1 22 (g, h)    1
     (g, a)    1
     (h, b)    1
     (a, f)    1

In [270]:
df = df.unstack(level=-1, fill_value=0)
df.head()

        cnt                                                                 \
0    (a, b) (a, c) (a, d) (a, e) (a, f) (a, g) (a, i) (a, j) (b, a) (b, c)
  id
0 11      0      1      0      0      0      0      0      0      0      0
1 22      1      0      0      0      1      0      1      1      0      0
2 33      0      0      1      0      0      0      0      0      1      1
3 44      0      0      0      0      0      0      0      0      0      0
4 55      0      1      0      1      0      0      1      0      0      0

      ...                                                                 \
0     ... (i, b) (i, c) (i, d) (i, e) (i, g) (i, j) (j, a) (j, b) (j, d)
  id  ...
0 11  ...      0      0      0      0      0      0      0      0      0
1 22  ...      1      0      0      0      0      1      0      1      0
2 33  ...      0      1      1      1      1      1      1      0      1
3 44  ...      0      1      0      0      0      0      0      0      0
4 55  ...      0      0      0      0      0      0      0      0      0


0    (j, e)
  id
0 11      0
1 22      0
2 33      1
3 44      0
4 55      0

[5 rows x 63 columns]

In [272]:
df.sum(axis=0).head()

cnt  (a, b)    2
     (a, c)    2
     (a, d)    1
     (a, e)    3
     (a, f)    1
dtype: int64

# cumulitive sum after groupby <a class="anchor" id="cum-sum-after-groupby"></a>

In [37]:
data = [[1, 8, 2], [1, 2, 5], [2, 6, 9]]
df = pd.DataFrame(data, columns=["a", "b", "c"],
                index=["fox", "gorilla", "lion"])
df

         a  b  c
fox      1  8  2
gorilla  1  2  5
lion     2  6  9

Когда делаем cumsum  
то пропадает столбец, по которому группируем  
поэтому, если нужно его сохранить, то сначала его нужно сделать индексом  
либо указать после группировки

In [38]:
df.groupby("a").cumsum()

          b  c
fox       8  2
gorilla  10  7
lion      6  9

In [39]:
# df.groupby("a").groups
df.groupby("a")[df.columns].cumsum()

         a   b  c
fox      1   8  2
gorilla  2  10  7
lion     2   6  9

In [26]:
df.set_index('a', append=True).groupby("a").cumsum()

            b  c
        a
fox     1   8  2
gorilla 1  10  7
lion    2   6  9

In [2]:
df = pd.DataFrame({'col1' : ['A', 'B', 'A', 'A', 'B'], 'col2' : ['D', 'C', 'C', 'C', 'D'], 'col3' : [1, 2, 3, 4, 5]})
df

  col1 col2  col3
0    A    D     1
1    B    C     2
2    A    C     3
3    A    C     4
4    B    D     5

In [3]:
df = df.set_index(['col1', 'col2']).groupby('col1').cumsum()
df

           col3
col1 col2
A    D        1
B    C        2
A    C        4
     C        8
B    D        7

In [4]:
df.index = df.index.set_names(['first_level', 'second_level'])
df

                          col3
first_level second_level
A           D                1
B           C                2
A           C                4
            C                8
B           D                7

In [6]:
df.rename_axis(index={'first_level': 'FIRST_INDEX'})

                          col3
FIRST_INDEX second_level
A           D                1
B           C                2
A           C                4
            C                8
B           D                7

In [11]:
df = df.rename_axis("my_cols", axis="columns")
df

my_cols                   col3
first_level second_level
A           D                1
B           C                2
A           C                4
            C                8
B           D                7

In [13]:
df.rename_axis(columns={'my_cols': 'columns'})

columns                   col3
first_level second_level
A           D                1
B           C                2
A           C                4
            C                8
B           D                7

# Style <a class="anchor" id="style"></a>

In [38]:
df = pd.DataFrame({'col1' : [11, None, 13, 14, 15], 'col2' : [None, 22, 23, 24, 25], 'col3' : [1, 2, 3, 4, None]})
df

   col1  col2  col3
0  11.0   NaN   1.0
1   NaN  22.0   2.0
2  13.0  23.0   3.0
3  14.0  24.0   4.0
4  15.0  25.0   NaN

In [39]:
df.style.set_caption('caption')

Метод set_table_styles позволяет отформатировать выбранный объект.   
В данном случае нас интересует 'caption' (подпись). В качестве параметра 'props' передаём список,     
где каждый элемент – кортеж формата (параметр, значение). Например, укажем новый цвет ('color') и размер шрифта ('font-size'):

In [40]:
(df
 .style
 .set_caption('Это название таблицы')
 .set_table_styles([{'selector': 'caption', 
                     'props': [('color', 'green'), ('font-size', '15px')]
                     }])
)

Выделять пропущенные значения можно с помощью highlight_null()

In [41]:
df.style.highlight_null()

In [42]:
df = df.fillna(0)

In [43]:
df.style.background_gradient(cmap='RdYlGn')

highlight_max – подсвечивает цветом наибольшее значение. Можно применить либо к каждой строке (axis=0/'index'), либо к каждой колонке (axis=1/'columns').

In [44]:
df.style.highlight_max(axis=1)

In [45]:
df.style.highlight_max(axis=0, color='green')

Визуализировать значения можно прямо в таблице с помощью .bar(). Данный метод принимает несколько аргументов:

subset – колонки, для которых нужно построить небольшой барплот  
color – цвет  
align – выравнивание столбиков (mid – центр ячейки в (max-min)/2; zero – ноль находится в центре ячейки; left – минимальное значение находится в левой части ячейки)

In [46]:
(df.style
.bar(subset=['col3'], color='#67A5EB'))

Иногда может понадобиться определенное число знаков после запятой,   
значок валюты, удаление ненужных символов и так далее. Для этого существует метод .format().

In [47]:
df['col4'] = ['as df', 'sa df', 'sad fdas', 'sa dfa', 's df']

В format можно передать словарь с названиями колонок для изменения

In [61]:
import re
(df.style
 .format({'col4': lambda x: x.upper(), 
          'col4': lambda x: re.sub(r'[ /]', '_', x.lower())})
 .highlight_max(subset='col3')
 .format('${:.2f}', subset='col2')
)

Скрыть индекс

In [52]:
df.style.set_caption('It is caption').hide_index()

Скрытиь колонку

In [54]:
df.style.hide_columns('col4')

Еще один полезный метод – set_properties, позволяет более гибко настроить другие параметры отображения.   
Например, выровнять текст по левому краю ('text-align'), сделать фон черным ('background-color'), а текст – оранжевым ('color'):

In [58]:
(df.style.set_caption('Это название таблицы')
 .hide_index()
 .set_table_styles([{
    'selector': 'caption',
    'props': [('color', 'black'),('font-size', '14px')
    ]}])
 .set_properties(**{'text-align': 'left',
                    'background-color': 'black',    
                    'color': 'darkorange'})
)

# from-list-in-cell-to-new-columns <a class="anchor" id="from-list-in-cell-to-new-columns"></a>

In [4]:
df = pd.DataFrame({'a': [[1,2,3], [2,4], [1]], 'b': [[3], [5,2,4], [7,1]]})
df

           a          b
0  [1, 2, 3]        [3]
1     [2, 4]  [5, 2, 4]
2        [1]     [7, 1]

In [6]:
def func(row):
    res = []
    for index, val in row.items():
        index = [(index, i) for i in range(len(val))]
        res.append(pd.Series(val, index=index))
    return pd.concat(res)
df = df.apply(func, axis=1)
df

     a              b
     0    1    2    0    1    2
0  1.0  2.0  3.0  3.0  NaN  NaN
1  2.0  4.0  NaN  5.0  2.0  4.0
2  1.0  NaN  NaN  7.0  1.0  NaN

In [8]:
df.stack().reset_index(-1, drop=True)

     a    b
0  1.0  3.0
0  2.0  NaN
0  3.0  NaN
1  2.0  5.0
1  4.0  2.0
1  NaN  4.0
2  1.0  7.0
2  NaN  1.0

# melt (from many columns to one) <a class="anchor" id="melt"></a>

У нас есть колонки, которые мы не хотим менять, их указываем в `id_vars`,  
и у нас есть колонки, которые мы хотим 'расплавить' 
то есть сделать из них одну каетгориальную переменную, в которой названия колонок будут занчения    
Изначально у нас есть, например, 2 колонки для плавки, у которых 2 имени и значения  
имена попадают в одну колонку (указываем в параметре `value_vars`), а значения в другую (колонка будет автоматиче  ски создана)  
имена у этих новых двух колонок можно менять в `var_name='myVarname', value_name='myValname'`  
Также если у нас индекс со значениями, то его нужно сначала сбросить и указать эту колонку в `id_vars`,  
так как индекс у итоговй колонки свой и старый пропадает

In [10]:
df = pd.DataFrame({'A1': {0: 'a', 1: 'b', 2: 'c'},
                   'A2': {0: 'aa', 1: 'bb', 2: 'cc'},
                   'B': {0: 1, 1: 3, 2: 5},
                   'C': {0: 2, 1: 4, 2: 6}})
df

  A1  A2  B  C
0  a  aa  1  2
1  b  bb  3  4
2  c  cc  5  6

In [11]:
df.melt(id_vars=['A1', 'A2'], value_vars=['B'])

  A1  A2 variable  value
0  a  aa        B      1
1  b  bb        B      3
2  c  cc        B      5

In [10]:
df.melt(id_vars=['A'], value_vars=['B', 'C'])

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5
3  a        C      2
4  b        C      4
5  c        C      6

In [12]:
df.melt(id_vars=['A'], value_vars=['B', 'C'],
        var_name='myVarname', value_name='myValname')

   A myVarname  myValname
0  a         B          1
1  b         B          3
2  c         B          5
3  a         C          2
4  b         C          4
5  c         C          6

можно сохранить исходный индексы

In [14]:
df.melt(id_vars=['A'], value_vars=['B', 'C'], ignore_index=False)

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5
0  a        C      2
1  b        C      4
2  c        C      6

In [15]:
df.columns = [list('ABC'), list('DEF')]
df

   A  B  C
   D  E  F
0  a  1  2
1  b  3  4
2  c  5  6

In [18]:
df.melt(col_level=0, id_vars=['A'], value_vars=['B'])

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5

In [17]:
df.melt(id_vars=[('A', 'D')], value_vars=[('B', 'E')])

  (A, D) variable_0 variable_1  value
0      a          B          E      1
1      b          B          E      3
2      c          B          E      5

In [12]:
df = pd.DataFrame({'A': {0: 'a', 1: 'b', 2: 'c'},
                   'B': {0: 1, 1: 3, 2: 5},
                   'C': {0: 2, 1: 4, 2: 6}})
df

   A  B  C
0  a  1  2
1  b  3  4
2  c  5  6

In [13]:
temp = df.melt(id_vars=['A'], value_vars=['B', 'C'], ignore_index=False)
temp

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5
0  a        C      2
1  b        C      4
2  c        C      6

Если в pivot_table колонку в `values` указать в квадратных скобках, то будет мультииндекс, то есть название будет уровнем

In [20]:
temp.pivot_table(index='A', columns=['variable'], values=['value'])

         value
variable     B  C
A
a            1  2
b            3  4
c            5  6

In [21]:
temp.pivot_table(index='A', columns=['variable'], values='value')

variable  B  C
A
a         1  2
b         3  4
c         5  6

In [29]:
df = pd.DataFrame({'A': {0: 'a', 1: 'b', 2: 'c'},
                   'B': {0: 1, 1: 3, 2: 5},
                   'C': {0: 2, 1: 4, 2: 6}})
df

   A  B  C
0  a  1  2
1  b  3  4
2  c  5  6

In [9]:
df.append({'A': 'f', 'B': 7, 'C': 9}, ignore_index=True)

   A  B  C
0  a  1  2
1  b  3  4
2  c  5  6
3  f  7  9

iloc нельзя ставить индекс несуществующий  
поэтому чтобы добавить новую строку можно использовать либо   
append, либо loc[новый индекс]

In [30]:
df.loc[3] = ['d', 4, 8]
df

   A  B  C
0  a  1  2
1  b  3  4
2  c  5  6
3  d  4  8

In [33]:
df[df.B.between(3, 5)]

   A  B  C
1  b  3  4
2  c  5  6
3  d  4  8

In [32]:
df[df.B.between(3, 5, 'neither')]

   A  B  C
3  d  4  8

In [17]:
df = pd.DataFrame({'A': np.random.random(5), 'B': np.random.random(5)})
df

          A         B
0  0.175511  0.444826
1  0.382371  0.707147
2  0.135403  0.011961
3  0.073230  0.246665
4  0.177908  0.075272

In [18]:
df.round({'A':2, 'B':3})

      A      B
0  0.18  0.445
1  0.38  0.707
2  0.14  0.012
3  0.07  0.247
4  0.18  0.075

In [24]:
df[['A']].shift(2, fill_value='-')

          A
0         -
1         -
2  0.175511
3  0.382371
4  0.135403

In [2]:
df = pd.DataFrame({'number': np.random.randint(1, 100, 10)})
df

   number
0      70
1      99
2      33
3      41
4      73
5      15
6      98
7       7
8      35
9      31

In [7]:
df['intervals'] = pd.cut(df.number, 10)
df

   number       intervals
0      61    (54.5, 62.8]
1      73    (71.1, 79.4]
2      13  (12.917, 21.3]
3      19  (12.917, 21.3]
4      86    (79.4, 87.7]
5      20  (12.917, 21.3]
6      84    (79.4, 87.7]
7      93    (87.7, 96.0]
8      96    (87.7, 96.0]
9      26    (21.3, 29.6]

In [8]:
bins=[1, 20, 40, 60, 80, 100]
df['intervals'] = pd.cut(df.number,bins=bins)
df

   number  intervals
0      61   (60, 80]
1      73   (60, 80]
2      13    (1, 20]
3      19    (1, 20]
4      86  (80, 100]
5      20    (1, 20]
6      84  (80, 100]
7      93  (80, 100]
8      96  (80, 100]
9      26   (20, 40]

In [10]:
labels=['1 to 20', '21 to 40', '41 to 60', '61 to 80', '81 to 100']
bins=[1, 20, 40, 60, 80, 100]
df['intervals'] = pd.cut(df.number,bins=bins, labels=labels)
df

   number  intervals
0      61   61 to 80
1      73   61 to 80
2      13    1 to 20
3      19    1 to 20
4      86  81 to 100
5      20    1 to 20
6      84  81 to 100
7      93  81 to 100
8      96  81 to 100
9      26   21 to 40

right меняет края интервалов  
если right = True, то правый включается, а левый нет,    
если False, то наоборо

In [13]:
bins=[1, 20, 40, 60, 80, 100]
df['intervals'] = pd.cut(df.number,bins=bins, right=True)
df

   number  intervals
0      61   (60, 80]
1      73   (60, 80]
2      13    (1, 20]
3      19    (1, 20]
4      86  (80, 100]
5      20    (1, 20]
6      84  (80, 100]
7      93  (80, 100]
8      96  (80, 100]
9      26   (20, 40]

qcut разбивает на перцентили, то есть упорядочивает данные и делит на интервалы,  
чтобы в каждом было одинаковое количество элементов и потом получаются границы интервалов  
А обычный cut просто берет размах от макс до мин, делит на равные части, это границы интервалов,  
и теперь распределяет по этим интервалам

qcut нужно все одинаковые элементы отнести в один bin,  
поэтому, если например у нас 5 значений и среди них 2 одинаковых и мы хотим разбить на  
5 частей, то будет ошибка

In [3]:
df = pd.DataFrame({'number': [3, 1, 2, 1, 4]})
df

   number
0       3
1       1
2       2
3       1
4       4

In [4]:
pd.qcut(df.number, 5)

ValueError: Bin edges must be unique: array([1. , 1. , 1.6, 2.4, 3.2, 4. ]).
You can drop duplicate edges by setting the 'duplicates' kwarg

нужно сначала отранжировать

In [14]:
df.rank(method='first')

   number
0     4.0
1     1.0
2     3.0
3     2.0
4     5.0

In [10]:
pd.qcut(df.number.rank(method='first'), 5)

0    (0.999, 1.8]
1      (1.8, 2.6]
2      (2.6, 3.4]
3      (3.4, 4.2]
4      (4.2, 5.0]
Name: number, dtype: category
Categories (5, interval[float64, right]): [(0.999, 1.8] < (1.8, 2.6] < (2.6, 3.4] < (3.4, 4.2] < (4.2, 5.0]]

In [3]:
df = pd.DataFrame({'number': np.random.randint(1, 100, 10)})
df

   number
0      16
1      92
2      25
3      84
4       7
5      60
6      69
7      57
8      99
9      33

In [9]:
pd.qcut(df.number, 5)

0    (6.999, 23.2]
1     (85.6, 99.0]
2     (23.2, 47.4]
3     (63.6, 85.6]
4    (6.999, 23.2]
5     (47.4, 63.6]
6     (63.6, 85.6]
7     (47.4, 63.6]
8     (85.6, 99.0]
9     (23.2, 47.4]
Name: number, dtype: category
Categories (5, interval[float64, right]): [(6.999, 23.2] < (23.2, 47.4] < (47.4, 63.6] < (63.6, 85.6] < (85.6, 99.0]]

rolling это типа скользящее среднее, если мы используем mean  
можем использовать любую функцию вместо mean 
смысл в том, что мы идем в окне последних n значений и считаем по ним значение и вносим в ячейку 
первые n-1 ячеек будут nan, а потом у нас будет скользить окно размером n и считаться статистика

In [11]:
df = pd.DataFrame({'a': range(20)})
df['rolling'] = df.a.rolling(10).mean().head(20)
df

     a  rolling
0    0      NaN
1    1      NaN
2    2      NaN
3    3      NaN
4    4      NaN
5    5      NaN
6    6      NaN
7    7      NaN
8    8      NaN
9    9      4.5
10  10      5.5
11  11      6.5
12  12      7.5
13  13      8.5
14  14      9.5
15  15     10.5
16  16     11.5
17  17     12.5
18  18     13.5
19  19     14.5

Аналог оконных функций sql

In [41]:
data = pd.DataFrame({
    'key_1' : ['x', 'x', 'x', 'y', 'y', 'y'],
    'key_2' : [3, 1, 2, 4, 4, 6]
})

# Здесь добавляете ранги внутри каждой из групп
data['rank'] = data \
    .groupby('key_1', as_index=False)['key_2'] \
    .rank(method='first', ascending=True)
data

  key_1  key_2  rank
0     x      3   3.0
1     x      1   1.0
2     x      2   2.0
3     y      4   1.0
4     y      4   2.0
5     y      6   3.0

Если после groupby поставить apply, то туда по очереди придут группы  
Далее с ними можно сделать что угодно, и в зависимотси какие индексы мы вернем из функции  
в apply у нас будет разный результат,  
если мы не изменим индекс, то он будет как был,  
но если мы в каждой группе изменим индекс,  
то в итоговом фрейме у нас будет мультииндекс  
он будет состоять из имени группы и индекса, который мы сделали внутри функции для каждой группы

In [58]:
df = pd.DataFrame({
    'key_1' : ['x', 'x', 'x', 'y', 'y', 'y'],
    'key_2' : [6, 5, 6, 8, 4, 8],
    'key_3' : [1, 2, 3, 4, 5, 6]
})
group_name = df.key_1.unique()
def func(x):
    print(x)
    return x
df.groupby('key_1').apply(func)

  key_1  key_2  key_3
0     x      6      1
1     x      5      2
2     x      6      3
  key_1  key_2  key_3
3     y      8      4
4     y      4      5
5     y      8      6

  key_1  key_2  key_3
0     x      6      1
1     x      5      2
2     x      6      3
3     y      8      4
4     y      4      5
5     y      8      6

In [60]:
df = pd.DataFrame({
    'key_1' : ['x', 'x', 'x', 'y', 'y', 'y'],
    'key_2' : [6, 5, 6, 8, 4, 8],
    'key_3' : [1, 2, 3, 4, 5, 6]
})
group_name = df.key_1.unique()
def func(x):
    print(x)
    return x.reset_index(drop=True)
df.groupby('key_1').apply(func)

  key_1  key_2  key_3
0     x      6      1
1     x      5      2
2     x      6      3
  key_1  key_2  key_3
3     y      8      4
4     y      4      5
5     y      8      6

        key_1  key_2  key_3
key_1
x     0     x      6      1
      1     x      5      2
      2     x      6      3
y     0     y      8      4
      1     y      4      5
      2     y      8      6

In [63]:
df = pd.DataFrame({
    'key_1' : ['x', 'x', 'x', 'y', 'y', 'y'],
    'key_2' : [6, 5, 6, 8, 4, 8],
    'key_3' : [1, 2, 3, 4, 5, 6]
})
group_name = df.key_1.unique()
def func(x):
    print(x)
    x.index = [1 for el in x.index]
    return x
df.groupby('key_1').apply(func)

  key_1  key_2  key_3
0     x      6      1
1     x      5      2
2     x      6      3
  key_1  key_2  key_3
3     y      8      4
4     y      4      5
5     y      8      6

        key_1  key_2  key_3
key_1
x     1     x      6      1
      1     x      5      2
      1     x      6      3
y     1     y      8      4
      1     y      4      5
      1     y      8      6

by in plot

In [16]:
df = pd.DataFrame({
    'key_1' : ['x', 'x', 'x', 'y', 'y', 'y'],
    'key_2' : [6, 5, 6, 8, 4, 8],
    'key_3' : [1, 2, 3, 4, 5, 6]
})
df

  key_1  key_2  key_3
0     x      6      1
1     x      5      2
2     x      6      3
3     y      8      4
4     y      4      5
5     y      8      6

In [ ]:
df.key_2.hist(by=df.key_1)

Цветовые палитры

Чтобы уставноить значения по дефолту меняем настройки матплотлиб  
Важно plt.cm для cycle выбирать дискретные

In [63]:
import matplotlib.pyplot as plt
import matplotlib as mpl
plt.rcParams['image.cmap'] = 'viridis'
cmap = mpl.colormaps['viridis']
plt.rcParams['axes.prop_cycle'] = plt.cycler(color=plt.cm.Set3.colors)

In [ ]:
plt.plot([1,2,3])

fillna, когда нужно заоплнить не одним значением  
Если мы в fillna передадим фрейм такого же значения, то 
для заополнения возьмуться соответствующие занчения    
Это очень удобно, если мы хотим заполнить пропуски медианой врутри групп    
Мы делаем фрейм с медианами и всталяем в fillna

In [23]:
df = pd.DataFrame({
    'key_1' : ['x', 'x', 'x', 'x', 'y', 'y', 'y', 'y'],
    'key_2' : [6, None, 6, 7, 8, 4, None, 3],
    'key_3' : [1, None, 3, 2, None, 5, 6, 9]
})
df

  key_1  key_2  key_3
0     x    6.0    1.0
1     x    NaN    NaN
2     x    6.0    3.0
3     x    7.0    2.0
4     y    8.0    NaN
5     y    4.0    5.0
6     y    NaN    6.0
7     y    3.0    9.0

In [26]:
df.fillna(pd.DataFrame({
    'key_1' : ['x', 'x', 'x', 'x', 'y', 'y', 'y', 'y'],
    'key_2' : [6, 111, 6, 7, 8, 4, 222, 3],
    'key_3' : [1, 444, 3, 2, 333, 5, 6, 9]
}))

  key_1  key_2  key_3
0     x    6.0    1.0
1     x  111.0  444.0
2     x    6.0    3.0
3     x    7.0    2.0
4     y    8.0  333.0
5     y    4.0    5.0
6     y  222.0    6.0
7     y    3.0    9.0

transform работает как оконная функция в sql  
Эта функция применяет переданную ей функцию к группе и заполняет каждую ячейку в группе этим значением  
без схлопывания  
При расчетах она не учитывает ячейки с null

In [29]:
key_3_median = df.groupby('key_1')[['key_3']].transform('median')
key_3_median

   key_3
0    2.0
1    2.0
2    2.0
3    2.0
4    6.0
5    6.0
6    6.0
7    6.0

In [ ]:
key_3_median = df.groupby('key_1')[['key_3']].transform('median')
key_3_median

In [40]:
df = pd.DataFrame({
    'key_1' : ['x', 'x', 'x', 'y', 'y', 'y'],
    'key_2' : [2, 9, 6, 7, 1, 5],
})
df.groupby('key_1').mean().sort_values('key_2').style.format({'key_2': '{:.2%}'})

join используется, когда нужно соеденить по индексам,  
особенно когда мульти индекс

In [13]:
df1 = pd.DataFrame({
    'col1' : ['x', 'x', 'x', 'y', 'y', 'y'],
    'col2' : [2, 9, 6, 7, 1, 5],
    'user_id' : [1, 2, 3, 4, 5, 6],
})
df2 = pd.DataFrame({
    'user_id' : [1, 2, 3, 4, 5, 6],
    'col1' : [1, 2, 3, 4, 5, 6],
})

In [14]:
df1

  col1  col2  user_id
0    x     2        1
1    x     9        2
2    x     6        3
3    y     7        4
4    y     1        5
5    y     5        6

In [15]:
df1 = df1.set_index(['user_id', 'col1'])
df1

              col2
user_id col1
1       x        2
2       x        9
3       x        6
4       y        7
5       y        1
6       y        5

In [16]:
df2

   user_id  col1
0        1     1
1        2     2
2        3     3
3        4     4
4        5     5
5        6     6

In [33]:
df1.merge(df2, on='user_id')

   user_id  col2  col1
0        1     2     1
1        2     9     2
2        3     6     3
3        4     7     4
4        5     1     5
5        6     5     6

In [35]:
df1.merge(df2.set_index('user_id'), left_index=True, right_index=True)

              col2  col1
user_id col1
1       x        2     1
2       x        9     2
3       x        6     3
4       y        7     4
5       y        1     5
6       y        5     6

In [27]:
# так как у нас нет у колонок общих индексов, то нужно указать по какому полю соединяем  
# у второй таблицы возьмется это поле, а у первой индекс
df1.join(df2, on='user_id')

              col2  user_id  col1
user_id col1
1       x        2      2.0   2.0
2       x        9      3.0   3.0
3       x        6      4.0   4.0
4       y        7      5.0   5.0
5       y        1      6.0   6.0
6       y        5      NaN   NaN

In [28]:
# если у обоих таблиц есть общий индекс, то можно ничего не указывать 
# и в этом случае у нас будет только одни user_id  
# так как они оба индексы и останется только один
df1.join(df2.set_index('user_id'))

              col2  col1
user_id col1
1       x        2     1
2       x        9     2
3       x        6     3
4       y        7     4
5       y        1     5
6       y        5     6

Изменение типов столбцов

In [2]:
df = pd.DataFrame({
    'col1' : ['x', 'x', 'x', 'y', 'y', 'y'],
    'col2' : ['2', 9, 6, 7, 1, 5],
    'user_id' : [1, '2', 3, 4, 5, 6],
})
df.dtypes

col1       object
col2       object
user_id    object
dtype: object

In [5]:
dict_types = dict(col1=float
                  , co2_id=int)
df = df.astype(dict_types)
df.dtypes

col1        object
col2       float64
user_id      int32
dtype: object

In [6]:
sys.getsizeof(df)

976

Метод expanding() в Pandas позволяет применить функцию к расширяющемуся окну значений.

По мере прохождения DataFrame окно рассматриваемых строк растёт от начала до текущей строки, что позволяет проводить кумулятивные вычисления.

Кроме того, Pandas позволяет указать минимальное количество наблюдений, которое должно быть представлено перед выполнением вычисления. 
Это может быть особенно полезно в ранних строках DataFrame, когда определённые статистики должны быть рассчитаны только при наличии достаточного количества данных.

In [15]:
df = pd.DataFrame(
    [i for i in range(100)],
    columns=["a"]
)
df.head()

   a
0  0
1  1
2  2
3  3
4  4

In [19]:
df.expanding(3).sum().head()

      a
0   NaN
1   NaN
2   3.0
3   6.0
4  10.0